In [2]:
#importing packages 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv('/Users/sasha/Desktop/DATASCIENCE/2023/Mini-Project/data.nosync/cleaned_FULL_data.csv')
customers = pd.read_csv('/Users/sasha/Desktop/DATASCIENCE/2023/Mini-Project/data.nosync/cleaned_CUSTOMERS_data.csv')
income = pd.read_csv('/Users/sasha/Desktop/DATASCIENCE/2023/Mini-Project/data.nosync/income_predicted.csv')

In [4]:
df = df.drop(['Unnamed: 0'], axis =1)
df.head()

,from_account,money_amount,to_account,date,transaction_ID,Categorised,type_
0,NaN,4.00,CINEMA,2025-01-01,0,Cinema,Normal
1,40544.0,4.60,A_LOCAL_COFFEE_SHOP,2025-01-01,1,Coffee shop,Normal
2,88339.0,2.40,40544,2025-01-01,2,betweeen,betweeen
3,85149.0,4.65,A_LOCAL_COFFEE_SHOP,2025-01-01,3,Coffee shop,Normal
4,18555.0,2.40,85149,2025-01-01,4,betweeen,betweeen

In [5]:
customers = customers.drop(['Unnamed: 0'], axis =1)
customers.head()

,min,max,mean,sum,count,mode,customer_ID
0,1.45,1960.00,14.853905,37565.525305,2529,A_LOCAL_COFFEE_SHOP,1
1,1.45,299.00,14.959220,15527.670740,1038,PUB,100002
2,1.45,1955.00,33.762143,22924.494825,679,LOCAL_WATERING_HOLE,100019
3,1.45,381.25,22.950110,15927.376375,694,6053,100027
4,1.45,302.50,10.571419,13415.130350,1269,COFFEE_SHOP,10004

In [6]:
income = income.drop(['Unnamed: 0', 'After_tax'], axis =1)
income = income.rename(columns={'from_account':'customer_ID'})
income['customer_ID'] = income['customer_ID'].astype(int)
income.head()

   customer_ID   Inferior        Normal              x  Percentile  Before_tax
0            1  511.756790  17761.593923  36034.944637          99      183000
1           21  950.224367  20161.972033  41274.168433          99      183000
2           45  215.681159  19175.864958  38567.411075          99      183000
3           53  991.650924  17966.606913  36924.864750          99      183000
4           64  201.513333  15282.259502  30766.032338          99      183000

In [7]:
customers = pd.merge(customers, income)
customers.head()

,min,max,mean,sum,count,mode,customer_ID,Inferior,Normal,x,Percentile,Before_tax
0,1.45,1960.00,14.853905,37565.525305,2529,A_LOCAL_COFFEE_SHOP,1,511.756790,17761.593923,36034.944637,99,183000
1,1.45,299.00,14.959220,15527.670740,1038,PUB,100002,732.759653,11355.081087,23442.921827,88,54600
2,1.45,1955.00,33.762143,22924.494825,679,LOCAL_WATERING_HOLE,100019,100.985526,9866.321521,19833.628569,66,33600
3,1.45,381.25,22.950110,15927.376375,694,6053,100027,145.800000,11058.403875,22262.607750,83,47600
4,1.45,302.50,10.571419,13415.130350,1269,COFFEE_SHOP,10004,247.950000,8850.199822,17948.349644,48,25600

In [8]:
df['dayOfWeek'] = pd.to_datetime(df['date']).dt.day_name()
df['Weekday'] = df['dayOfWeek'].map(lambda x: 1 if x in ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday']  else 0)
df = df.drop(columns=['dayOfWeek'])
df = pd.concat([df.drop('Categorised', 1), pd.get_dummies(df.Categorised).mul(1)], axis=1)
df = df.rename(columns={'from_account':'customer_ID'})
df = df.dropna(subset=['customer_ID'])
df['customer_ID'] = df['customer_ID'].astype(int)
df = pd.merge(df,customers[['customer_ID', 'Before_tax']])

/var/folders/py/d721tqvn39xbrq83g84j15pm0000gn/T/ipykernel_3481/2373435401.py:4: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  df = pd.concat([df.drop('Categorised', 1), pd.get_dummies(df.Categorised).mul(1)], axis=1)

In [9]:
df.head()

,customer_ID,money_amount,to_account,date,transaction_ID,type_,Weekday,Alcohol,Book store,Butcher,...,Kid's Leisure,Pets,Restaurant,Sports,Streaming service,Takeaway,Tea house,Toy store,betweeen,Before_tax
0,40544,4.60,A_LOCAL_COFFEE_SHOP,2025-01-01,1,Normal,1,0,0,0,...,0,0,0,0,0,0,0,0,0,43300
1,40544,2.15,A_LOCAL_COFFEE_SHOP,2025-01-01,20,Normal,1,0,0,0,...,0,0,0,0,0,0,0,0,0,43300
2,40544,4.85,GOURMET_COFFEE_SHOP,2025-01-01,22,Normal,1,0,0,0,...,0,0,0,0,0,0,0,0,0,43300
3,40544,2.15,COFFEE_SHOP,2025-01-01,43,Normal,1,0,0,0,...,0,0,0,0,0,0,0,0,0,43300
4,40544,2.15,COFFEE_SHOP,2025-01-02,38668,Normal,1,0,0,0,...,0,0,0,0,0,0,0,0,0,43300

In [10]:
#customers.to_csv('/Users/sasha/Desktop/DATASCIENCE/2023/Mini-Project/data.nosync/CUSTOMERS_data_forVis.csv')

In [11]:
#df.to_csv('/Users/sasha/Desktop/DATASCIENCE/2023/Mini-Project/data.nosync/main_data_forVis.csv')